---
kind: other
id: Methods.T:Autodesk.Revit.UI.RevitCommandId
source: html/66a5439d-abb3-e8a2-8d92-7404bcb98efa.htm
---
# RevitCommandId Methods

Looks up and retrieves the Revit command id with the given id string.